{
    "title": "Mentions légales",
    "content": [
        {
            "title": "IDENTIFICATION DE L’EDITEUR",
            "text": "Aymeric Godivier, 10 rue de la Neple, 87700, Aixe-sur-Vienne"
        },
        {
            "title":"HEBERGEMENT DU SITE",
            "text":"O2SWITCH\nCHE DES PARDIAUX 63000 CLERMONT FERRAND, FRANCE"
        },
        {
            "title": "CONTACT ADMINISTRATEUR",
            "text" : "Ce site est administré par M Aymeric Godivier. Pour toute questions se référant à l'administration du site veuillez contacter M Aymeric Godivier via le mail suivant : aymeric.godivier@gmail.com"
        },
        {
            "title":"CONDITIONS D’UTILISATION DU SITE",
            "text":"Le présent site internet est la propriété exclusive de « Aymeric Godivier». Il s’agit d’un site portefolio mettant en avant le travail de Monsieur Aymeric Godivier, et de tiers lors de travaux professionnels / étudiants communs. De ce fait, les éléments du site, tels que les textes, les images fixes ou animées, les bases de données, les programmes, les langages,… etc, sont protégés par toute législation en vigueur (le droit d’auteur, le droit suis generis du producteur de la base de données, droit des marques…). L’autorisation de reproduction ne vous est concédée que sous forme numérique en consultation. L’impression papier est autorisée aux fins de copie privée à l’usage exclusif du copiste au sens de l’article L. 122-5 2° du Code de la Propriété Intellectuelle. Les informations contenues dans le présent site internet sont données à titre indicatif et sont sujettes à changement sans préavis de la part de l’auteur M. Aymeric Godivier. Nous ne pouvons garantir l’exactitude des informations qu’il contient, ni le fonctionnement du site internet dans tous les cas de figure. Nous n’assumons aucune responsabilité relative aux informations contenues et à l’existence ou la disponibilité de toute offre mentionnée dans le présent site internet et déclinons toute responsabilité découlant d’une négligence ou autre concernant ces informations."
        },
        {
            "title": "LIMITATION DE RESPONSABILITÉ",
            "text":"Les renseignements et présentations contenus dans les pages de ce site sont fournis à titre purement indicatif et restent susceptibles de modifications de la part de l’auteur à tout moment et sans préavis. Leur utilisation à des fins privées ou professionnelles ne saurait engager la responsabilité de l'éditeur du présent site internet de quelque manière que ce soit. Il ne peut non plus garantir l’exactitude, la précision ou l’exhaustivité des informations mises à disposition sur ce site. Les photos ne sont pas contractuelles sauf mention contraire. En aucun cas, l’éditeur ni l’hébergeur du site ne peuvent être tenus responsables de dommages directs ou indirects, y compris mais de façon non limitative, de la perte de bénéfice, de clientèle ou de données, dus à l’utilisation ou de l’impossibilité d’utiliser le site et son contenu, ainsi que les éléments auxquels le site permet d’accéder. Cette limitation vaut, tant en matière contractuelle que délictuelle, même si l’éditeur et/ou l’hébergeur ont été informés de la possibilité d’un tel dommage. Enfin, l’éditeur de ce site internet ne peut garantir que le site sera en permanence en ligne et s’accorde le droit, à sa complète discrétion, de suspendre l’accès de tout ou partie du contenu du site."
        },
        {
            "title":"LOI APPLICABLE ET JURIDICTION",
            "text":"Le présent site, dans tous ses éléments, est régi par la loi française. L’éditeur de ce site internet est domicilié en France. Tout sujet concernant ce site est régi par la loi française sous juridiction d’un tribunal français. Bien que ce site soit accessible en dehors du territoire français, tout visiteur est responsable de son utilisation en accord avec les lois et réglementations françaises et celles de son pays incluant, mais non limités, aux chargements informatiques d’informations."
        },
        {
            "title":"DONNEES PERSONNELLES",
            "text": "Conformément à la loi du 6 Août 2004 dite “informatique et libertés”, les données que vous saisissez dans les différents formulaires ou liens email via le formulaire de contact, sont destinées à l’éditeur de ce site internet et demeurent strictement confidentielles, à la consultation seule de M. Aymeric Godivier. En utilisant ces formulaires, vous acceptez que l’auteur de ce site, M. Aymeric Godivier - seule personne habilitée à consulter ces données - vous recontacte via votre adresse mail, et utilisant les informations - inscrites par vous - dudit formulaire. Vous disposez d’un total droit d’accès, de modification, de rectification et de suppression des données qui vous concernent (art.34 de la loi « Informatique et Libertés ») par simple demande envoyée par mail à M. Aymeric Godivier."
        },
        {
            "title":"LIENS HYPERTEXTES",
            "text":"La présence de liens hypertexte renvoyant vers d’autres sites internet ne constitue pas une garantie sur la qualité de contenu et de bon fonctionnement desdits sites. Notre responsabilité ne saurait être engagée quant au contenu de ces sites. L’internaute doit utiliser ces informations avec les précautions d’usage. La création de liens hypertexte vers ce site est soumise à notre accord préalable. Dans le cas de la création d’un lien hypertexte vers ce site qui n’aurait pas fait l’objet d’un accord préalable, nous nous réservons le droit d’exiger à tout moment le retrait dudit lien hypertexte pointant sur ce site."
        },
        {
            "title":"LIENS HYPERTEXTES VERS DES SITES TIERS",
            "text" : "L'éditeur du présent site internet n’a pas vérifié l’intégralité des sites qui peuvent être liés au sien et ne peut être tenu responsable du contenu des sites vers lesquels des liens sont faits. Leur présence ne signifie en aucune manière que l'éditeur du présent site internet adhère à leur contenu ou accepte une responsabilité quelconque pour le contenu ou l’utilisation de cet autre site Internet. La responsabilité de l'éditeur du présent site internet ne peut être engagée pour le contenu erroné ou inexact, diffamatoire, injurieux, calomnieux, mensonger, obscène, pornographique, blasphématoire de l’un ou l’autre de ces sites de tiers. Vous accédez par conséquent au contenu de ces sites extérieurs sous votre seule et entière responsabilité. Les liens proposés par l'éditeur du présent site internet, sauf mention contraire, ne sont en aucune façon une forme de promotion ou de publicité. Ils sont proposés car ils sont soit les sources d’une information, ou ils offrent des informations supplémentaires et complémentaires à celles fournies sur le site présent. Ces liens sont proposés pour l’agrément des visiteurs seulement et l’éditeur ne prend aucune responsabilité quant à l’utilisation ou aux conséquences qui pourraient découler de la connexion. L’éditeur a pris des précautions raisonnables pour sa protection contre des virus informatiques mais ne peut garantir que ce site ou tout autre site en lien soit complétement sécurisé de tous les virus ou de tout autre dommage qui pourrait endommager les systèmes des visiteurs. Les visiteurs doivent s’assurer auparavant qu’ils sont eux-mêmes suffisamment protégés par leurs propres logiciels de protection."
        },
        {
            "title": "INFORMATION SUR LES COOKIES",
            "text": "Lors de la consultation de notre site, aucun cookie n’est déposé sur votre ordinateur. Ce site n’utilise aucun outil d’analyse de données, de traçage ou de mesure d’audience et ne récolte donc aucune donnée sur les éventuels visiteurs, sur tout navigateur confondu."
        },
        {
            "title":"CREDITS",
            "text": "Icone de drapeau britannique créé par riajulislam - Flaticon\n\nIcone de drapeau français créé par Freepik - Flaticon"
        }
    ]
   
    
}