{
    "title": "Legal Notice",
    "content": [
        {
            "title": "PUBLISHER IDENTIFICATION",
            "text": "Aymeric Godivier, 10 rue de la Neple, 87700, Aixe-sur-Vienne"
        },
        {
            "title":"SITE HOSTING",
            "text":"O2SWITCH\nCHE DES PARDIAUX 63000 CLERMONT FERRAND, FRANCE"
        },
        {
            "title": "ADMINISTRATOR CONTACT",
            "text" : "This site is administered by Mr. Aymeric Godivier. For any questions regarding the administration of the site, please contact Mr. Aymeric Godivier via the following email: aymeric.godivier@gmail.com"
        },
        {
            "title":"CONDITIONS OF USE OF THE SITE",
            "text":"The present website is the exclusive property of \"Aymeric Godivier.\" It is a portfolio site showcasing the work of Mr. Aymeric Godivier and third parties during joint professional/student projects. As such, the elements of the site, such as texts, static or animated images, databases, programs, languages, etc., are protected by all applicable legislation (copyright, sui generis rights of the database producer, trademark rights, etc.). Reproduction is only permitted in digital form for consultation. Paper printing is allowed for private copying for the exclusive use of the copier, as defined in Article L. 122-5 2° of the Intellectual Property Code. The information contained in this website is provided for informational purposes only and is subject to change without notice from the author, Mr. Aymeric Godivier. We cannot guarantee the accuracy of the information it contains, nor the operation of the website in all circumstances. We assume no responsibility for the information contained and for the existence or availability of any offer mentioned on this website and disclaim any liability arising from negligence or otherwise regarding this information."
        },
        {
            "title": "LIMITATION OF LIABILITY",
            "text":"The information and presentations contained in the pages of this site are provided for informational purposes only and are subject to modifications by the author at any time and without notice. Their use for private or professional purposes shall not engage the liability of the publisher of this website in any way. It cannot guarantee the accuracy, precision, or completeness of the information made available on this site. The photos are non-contractual unless otherwise stated. Under no circumstances can the publisher or the host of the site be held responsible for direct or indirect damages, including but not limited to loss of profit, clientele, or data, resulting from the use or inability to use the site and its content, as well as the elements to which the site provides access. This limitation applies in both contractual and tort matters, even if the publisher and/or the host have been informed of the possibility of such damage. Finally, the publisher of this website cannot guarantee that the site will be permanently online and reserves the right, at its sole discretion, to suspend access to all or part of the site’s content."
        },
        {
            "title":"APPLICABLE LAW AND JURISDICTION",
            "text":"The present site, in all its elements, is governed by French law. The publisher of this website is domiciled in France. Any matter concerning this site is governed by French law under the jurisdiction of a French court. Although this site is accessible outside of French territory, every visitor is responsible for its use in accordance with French laws and regulations and those of their country, including, but not limited to, the electronic loading of information."
        },
        {
            "title":"PERSONAL DATA",
            "text": "In accordance with the law of August 6, 2004 known as “data protection and freedoms,” the data you enter in the various forms or email links via the contact form are intended for the publisher of this website and remain strictly confidential, for the sole consultation of Mr. Aymeric Godivier. By checking the opt-in box “I accept the terms related to the use of my data” at the time of entering your data in the contact form, you agree that the author of this site, Mr. Aymeric Godivier - the only person authorized to consult this data - may contact you via your email address, using the information - entered by you - in said form. You have a full right of access, modification, rectification, and deletion of the data concerning you (art. 34 of the “Data Protection and Freedoms” law) by simply sending a request via email to Mr. Aymeric Godivier."
        },
        {
            "title":"HYPERTEXT LINKS",
            "text":"The presence of hypertext links to other websites does not constitute a guarantee regarding the quality of content and proper functioning of said sites. Our responsibility cannot be engaged regarding the content of these sites. Users must use this information with the usual precautions. The creation of hypertext links to this site is subject to our prior agreement. In the case of the creation of a hypertext link to this site that has not received prior agreement, we reserve the right to demand at any time the removal of said hypertext link pointing to this site."
        },
        {
            "title":"HYPERTEXT LINKS TO THIRD PARTY SITES",
            "text" : "The publisher of this website has not verified the entirety of the sites that may be linked to its own and cannot be held responsible for the content of the sites to which links are made. Their presence does not in any way mean that the publisher of this website adheres to their content or accepts any responsibility for the content or use of that other website. The publisher of this website cannot be held responsible for erroneous or inaccurate, defamatory, injurious, slanderous, false, obscene, pornographic, or blasphemous content from any of these third-party sites. You therefore access the content of these external sites at your sole and entire responsibility. The links proposed by the publisher of this website, unless otherwise stated, are in no way a form of promotion or advertising. They are offered because they are either the sources of information or they provide additional and complementary information to that provided on this site. These links are offered for the pleasure of visitors only and the publisher assumes no responsibility for the use or consequences that may arise from the connection. The publisher has taken reasonable precautions to protect against computer viruses but cannot guarantee that this site or any other linked site is completely secure from all viruses or any other damage that could harm the visitors' systems. Visitors must ensure beforehand that they are sufficiently protected by their own protection software."
        },
        {
            "title": "INFORMATION ON COOKIES",
            "text": "When visiting our site, no cookies are placed on your computer. This site does not use any data analysis, tracking, or audience measurement tools and therefore does not collect any data on potential visitors, regardless of the browser used."
        },
        {
            "title":"CREDITS",
            "text": "British flag icon created by riajulislam - Flaticon\n\nFrench flag icon created by Freepik - Flaticon"
        }
    ]
   
    
}